using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace SportBarFormula.Infrastructure.Migrations
{
    /// <inheritdoc />
    public partial class AddMoreMenuItemsSeedElements : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "MenuItems",
                columns: new[] { "MenuItemId", "CategoryId", "Description", "ImageURL", "Ingredients", "IsAvailable", "IsDeleted", "Name", "PreparationTime", "Price", "Quantity" },
                values: new object[,]
                {
                    { 2, 4, "Представяме ви изискани кроасани със шунка – идеално съчетание на аромати и текстури! Изпечени до съвършенство, тези маслени кроасани са внимателно напълнени с качествена шунка, топящ се чедър сос и сочни чери домати. Завършени с хрупкава зелена салата и бъркано яйце, те предлагат истинска кулинарна наслада. Насладете се на този кулинарен шедьовър, който ще ви зареди с енергия и удоволствие за деня!", "assets/im/Menu/Sandwiches/Кроасани-Шунка.jpg", "Кроасани с масло, Яйце, Шунка, Чедър сос, Чери домат, Зелена салата", true, false, "Кроасани Шунка и бъркано яйце", 15, 10.50m, 250 },
                    { 3, 4, "Опитайте вкусното ни панини с хрупкаво пиле – перфектната комбинация от вкусове и текстури! Ароматна багета, която обгръща сочно панирано пилешко филе. Допълнено с кисели краставички, маслина и  Цезар сос, това панини предлага уникален баланс от сладко, солено и кисело. Топено сирене и чедър слайс добавят кремообразност и богатство, а гарнитурата от хрупкави пържени картофи го прави идеален избор за всяко хранене. Насладете се на това изкушение, което ще задоволи всичките ви кулинарни желания!", "assets/im/Menu/Sandwiches/Панини-Хрупкаво-Пиле.jpg", "Питка багета, Панирано пилешко филе, Кисела краставичка, Цезар сос, Маслина каламата, Топено сирене, Чедър слайс, Пържени картофи", true, false, "Панини хрупкаво пиле", 10, 12.90m, 350 },
                    { 4, 10, "Представяме нашата изискана пица Куатро Формаджи – истински рай за любителите на сирена! Върху хрупкав блат нанасяме кремообразна сметана и добавяме четири вида сирена: кашкавал, пушено сирене, синьо сирене и пармезан. Всичко това завършваме с пресен домат за баланс и свежест. Насладете се на неповторимата комбинация от вкусове и текстури във всяко парче.", "assets/img/Menu/Pizza/Куатро-Фурмаджи.jpg", "Хрупкав блат, Сметана, Кашкавал, Пушено сирене, Синьо сирене, Пармезан, Пресен домат", true, false, "Куатро фурмаджи", 10, 11.90m, 480 },
                    { 5, 3, "Представяме ви салата Бурата – елегантност и свежест в една чиния! Съчетава нежното сирене бурата с белени домати и кремообразно авокадо за перфектен баланс. Прошутото добавя деликатен вкус, докато руколата и пармезанът придават изисканост. Завършваме с песто и нотка чили за лек пикантен акцент. Тази салата е идеална за всяко гурме преживяване.", "assets/img/Menu/Salad/Салата-бурата.jpg", "Сирене бурата, Белен домат, Авокадо, Прошуто, Рукола, Песто, Пармезан, Чили", true, false, "Салата бурата", 8, 16.90m, 400 },
                    { 6, 12, "Опитайте нашата вкусна пърленка със сирене и кашкавал – класическо изкушение, което ще ви накара да се усмихнете! Върху хрупкавия блат е разположено меко сирене и богат слой разтопен кашкавал, създаващи перфектната комбинация от кремообразна текстура и наситен вкус. Тази простота, съчетана с високо качество на съставките, прави пърленката идеалният избор за всяко време на деня.", "assets/img/Menu/Pearl/Пърленка-със-сирене-и-кашкавал.jpg", "Хрупкав блат, Сирене, Кашкавал", true, false, "Пърленка със сирене и кашкавал", 10, 5.90m, 250 },
                    { 7, 2, "Опитайте нашите апетитни панирани пилешки пръчици със сос айоли – идеалното съчетание на хрупкаво и нежно! Сочно пилешко филе, обвито в ароматна панировка от корнфлейкс, галета и яйце, и изпържено до съвършенство. Всяка хапка е истинско удоволствие, допълнена от кремообразния айоли сос. Тези пилешки пръчици са перфектното предястие, което ще задоволи всички ваши вкусови желания.", "assets/img/Menu/Starters/Панирани-пилешки-пръчки.jpg", "Айоли сос, Пилешко филе, Панирано: Корнфлейкс, Галета, Яйце", true, false, "Панирани пилешки пръчки", 8, 10.90m, 250 },
                    { 8, 2, "Заповядайте нашите хрупкави пържени картофи – идеалното допълнение към всяка биричка! Сервирани златисти и горещи, те са перфектната хапка за всеки апетит. Хрупкави отвън и меки отвътре, тези картофи ще ви накарат да се усмихнете с всяка хапка. Независимо дали ги споделяте с приятели или ги хапвате сами, те са идеалната компания за всяко питие в нашия бар. Насладете се на класическия вкус и забавната атмосфера!", "assets/img/Menu/Starters/Пържени-картофи.jpg", "Картофи", true, false, "Пържени картофи", 8, 4.90m, 250 },
                    { 9, 10, "Представяме ви нашата ароматна пица Салермо – истинско изкушение за ценителите на добрия вкус! В основата й е хрупкав блат, върху който нежно се разстила доматена салса, обогатена с босилек и риган. Добавяме богата порция кашкавал, който се топи под топлината. Вкусът е подсилен от ароматна луканка, сочна шунка и хрупкав бекон, които придават уникална наситеност. За финален щрих, добавяме кисели краставички за свежест и контраст. Насладете се на тази изискана комбинация от вкусове и текстури!", "assets/img/Menu/Pizza/Салерно.jpg", "Хрупкав блат, Доматена салса с босилек и риган, Кашкавал, Луканка, Шунка, Бекон, Кисела краставичка", true, false, "Салерно", 10, 11.90m, 480 },
                    { 10, 10, "Насладете се на класическата пица Маргарита – съвършенство във всеки залък! Върху хрупкав блат нанасяме богата доматена салса, овкусена с ароматен босилек и риган. Допълваме с разтапящ се кашкавал и моцарела, които придават кремообразна текстура и богат вкус. Финалният щрих са свежите резени пресен домат, които носят допълнителна сочност и баланс. Тази пица е класическо изкушение, което никога не омръзва!", "assets/img/Menu/Pizza/Маргарита.jpg", "Хрупкав блат, Доматена салса с босилек и риган, Кашкавал, Моцарела, Пресен домат", true, false, "Маргарита", 10, 9.90m, 480 },
                    { 11, 10, "Представяме ви нашата емблематична пица Формола – истинска наслада за любителите на месо! На хрупкавия блат нанасяме ароматна доматена салса с босилек и риган, която съчетава всички съставки. Богатият слой кашкавал покрива щедро количество телешко мляно месо, сочен бекон, крехко пилешко филе и пикантно чоризо. Завършваме с топено сирене, което добавя кремообразна текстура. Тази пица е идеалният избор за всички месо любители, търсещи интензивен вкус и удоволствие във всяка хапка!", "assets/img/Menu/Pizza/Формула.jpg", "Хрупкав блат, Доматена салса с босилек и риган, Кашкавал, Телешко Мляно, Бекон, Пилешко филе, Чоризо, Топено сирене", true, false, "Формула", 10, 13.90m, 480 },
                    { 12, 3, "Насладете се на нашата традиционна Шопска салата – класическо българско удоволствие! Съчетава свежи домати, краставици и пресен пипер за перфектна хрупкавост. Добавяме меко краве сирене, което придава кремообразност и богатство на вкуса. Лукът и магданозът добавят свежест и аромат, а маслината завършва всичко с лек солен акцент. Тази салата е идеална за всеки повод и носи усещане за домашен уют и традиция.", "assets/img/Menu/Salad/Шопска-салата.jpg", "Домат, Краставица, Пресен пипер, Краве сирене, Лук, Магданоз, Маслина", true, false, "Шопска-салата", 8, 9.90m, 300 }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "MenuItems",
                keyColumn: "MenuItemId",
                keyValue: 12);
        }
    }
}
