using SportBarFormula.Infrastructure.Data.Models;

namespace SportBarFormula.Infrastructure.Data.SeedData;

public static class MenuItemsSeeds
{
    public static IEnumerable<MenuItem> GenerateMenuItems()
    {
        return new List<MenuItem>()
        {

            new MenuItem()
            {
               MenuItemId = 1,
               Name = "Чориззо",
               Description = "Почувствайте аромата на прясно изпечен, хрупкав блат, намазан с богата доматена салса, овкусена с риган и босилек. Върху него се разстила нежен слой разтопена моцарела, която съчетава вкусовете на апетитните парчета салам чоризо. Нотките на червен сладък лук и тънко нарязани черни маслини допълват вкусовото удоволствие, докато свежите доматени резени и парченца люта чушка добавят свежест и пикантност." +
                "Прекрасно съчетание на вкусове, което ви кара да се върнете за още!",
               Price = 10.90M,
               Quantity = 480,
               CategoryId = 10,
               ImageURL = "assets/img/Menu/Pizza/Chorizzo.jpg",
               IsAvailable = true,
               Ingredients = "Доматена паста, Моцарела, Чоризо, Люта Чушка, Червен Лук, Черна Маслина, Пресен Домат ",
               PreparationTime = 5,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 2,
               Name = "Кроасани Шунка и бъркано яйце",
               Description = "Представяме ви изискани кроасани със шунка – идеално съчетание на аромати и текстури! Изпечени до съвършенство, тези маслени кроасани са внимателно напълнени с качествена шунка, топящ се чедър сос и сочни чери домати. Завършени с хрупкава зелена салата и бъркано яйце, те предлагат истинска кулинарна наслада. Насладете се на този кулинарен шедьовър, който ще ви зареди с енергия и удоволствие за деня!",
               Price = 10.50M,
               Quantity = 250,
               CategoryId = 4,
               ImageURL = "assets/img/Menu/Sandwiches/Кроасани-Шунка.jpg",
               IsAvailable = true,
               Ingredients = "Кроасани с масло, Яйце, Шунка, Чедър сос, Чери домат, Зелена салата",
               PreparationTime = 15,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 3,
               Name = "Панини хрупкаво пиле",
               Description = "Опитайте вкусното ни панини с хрупкаво пиле – перфектната комбинация от вкусове и текстури! Ароматна багета, която обгръща сочно панирано пилешко филе. Допълнено с кисели краставички, маслина и  Цезар сос, това панини предлага уникален баланс от сладко, солено и кисело. Топено сирене и чедър слайс добавят кремообразност и богатство, а гарнитурата от хрупкави пържени картофи го прави идеален избор за всяко хранене. Насладете се на това изкушение, което ще задоволи всичките ви кулинарни желания!",
               Price = 12.90M,
               Quantity = 350,
               CategoryId = 4,
               ImageURL = "assets/img/Menu/Sandwiches/Панини-Хрупкаво-Пиле.jpg",
               IsAvailable = true,
               Ingredients = "Питка багета, Панирано пилешко филе, Кисела краставичка, Цезар сос, Маслина каламата, Топено сирене, Чедър слайс, Пържени картофи",
               PreparationTime = 10,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 4,
               Name = "Куатро фурмаджи",
               Description = "Представяме нашата изискана пица Куатро Формаджи – истински рай за любителите на сирена! Върху хрупкав блат нанасяме кремообразна сметана и добавяме четири вида сирена: кашкавал, пушено сирене, синьо сирене и пармезан. Всичко това завършваме с пресен домат за баланс и свежест. Насладете се на неповторимата комбинация от вкусове и текстури във всяко парче.",
               Price = 11.90M,
               Quantity = 480,
               CategoryId = 10,
               ImageURL = "assets/img/Menu/Pizza/Куатро-Фурмаджи.jpg",
               IsAvailable = true,
               Ingredients = "Хрупкав блат, Сметана, Кашкавал, Пушено сирене, Синьо сирене, Пармезан, Пресен домат",
               PreparationTime = 10,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 5,
               Name = "Салата бурата",
               Description = "Представяме ви салата Бурата – елегантност и свежест в една чиния! Съчетава нежното сирене бурата с белени домати и кремообразно авокадо за перфектен баланс. Прошутото добавя деликатен вкус, докато руколата и пармезанът придават изисканост. Завършваме с песто и нотка чили за лек пикантен акцент. Тази салата е идеална за всяко гурме преживяване.",
               Price = 16.90M,
               Quantity = 400,
               CategoryId = 3,
               ImageURL = "assets/img/Menu/Salad/Салата-бурата.jpg",
               IsAvailable = true,
               Ingredients = "Сирене бурата, Белен домат, Авокадо, Прошуто, Рукола, Песто, Пармезан, Чили",
               PreparationTime = 8,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 6,
               Name = "Пърленка със сирене и кашкавал",
               Description = "Опитайте нашата вкусна пърленка със сирене и кашкавал – класическо изкушение, което ще ви накара да се усмихнете! Върху хрупкавия блат е разположено меко сирене и богат слой разтопен кашкавал, създаващи перфектната комбинация от кремообразна текстура и наситен вкус. Тази простота, съчетана с високо качество на съставките, прави пърленката идеалният избор за всяко време на деня.",
               Price = 5.90M,
               Quantity = 250,
               CategoryId = 12,
               ImageURL = "assets/img/Menu/Pearl/Пърленка-със-сирене-и-кашкавал.jpg",
               IsAvailable = true,
               Ingredients = "Хрупкав блат, Сирене, Кашкавал",
               PreparationTime = 10,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 7,
               Name = "Панирани пилешки пръчки",
               Description = "Опитайте нашите апетитни панирани пилешки пръчици със сос айоли – идеалното съчетание на хрупкаво и нежно! Сочно пилешко филе, обвито в ароматна панировка от корнфлейкс, галета и яйце, и изпържено до съвършенство. Всяка хапка е истинско удоволствие, допълнена от кремообразния айоли сос. Тези пилешки пръчици са перфектното предястие, което ще задоволи всички ваши вкусови желания.",
               Price = 10.90M,
               Quantity = 250,
               CategoryId = 2,
               ImageURL = "assets/img/Menu/Starters/Панирани-пилешки-пръчки.jpg",
               IsAvailable = true,
               Ingredients = "Айоли сос, Пилешко филе, Панирано: Корнфлейкс, Галета, Яйце",
               PreparationTime = 8,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 8,
               Name = "Пържени картофи",
               Description = "Заповядайте нашите хрупкави пържени картофи – идеалното допълнение към всяка биричка! Сервирани златисти и горещи, те са перфектната хапка за всеки апетит. Хрупкави отвън и меки отвътре, тези картофи ще ви накарат да се усмихнете с всяка хапка. Независимо дали ги споделяте с приятели или ги хапвате сами, те са идеалната компания за всяко питие в нашия бар. Насладете се на класическия вкус и забавната атмосфера!",
               Price = 4.90M,
               Quantity = 250,
               CategoryId = 2,
               ImageURL = "assets/img/Menu/Starters/Пържени-картофи.jpg",
               IsAvailable = true,
               Ingredients = "Картофи",
               PreparationTime = 8,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 9,
               Name = "Салерно",
               Description = "Представяме ви нашата ароматна пица Салермо – истинско изкушение за ценителите на добрия вкус! В основата й е хрупкав блат, върху който нежно се разстила доматена салса, обогатена с босилек и риган. Добавяме богата порция кашкавал, който се топи под топлината. Вкусът е подсилен от ароматна луканка, сочна шунка и хрупкав бекон, които придават уникална наситеност. За финален щрих, добавяме кисели краставички за свежест и контраст. Насладете се на тази изискана комбинация от вкусове и текстури!",
               Price = 11.90M,
               Quantity = 480,
               CategoryId = 10,
               ImageURL = "assets/img/Menu/Pizza/Салерно.jpg",
               IsAvailable = true,
               Ingredients = "Хрупкав блат, Доматена салса с босилек и риган, Кашкавал, Луканка, Шунка, Бекон, Кисела краставичка",
               PreparationTime = 10,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 10,
               Name = "Маргарита",
               Description = "Насладете се на класическата пица Маргарита – съвършенство във всеки залък! Върху хрупкав блат нанасяме богата доматена салса, овкусена с ароматен босилек и риган. Допълваме с разтапящ се кашкавал и моцарела, които придават кремообразна текстура и богат вкус. Финалният щрих са свежите резени пресен домат, които носят допълнителна сочност и баланс. Тази пица е класическо изкушение, което никога не омръзва!",
               Price = 9.90M,
               Quantity = 480,
               CategoryId = 10,
               ImageURL = "assets/img/Menu/Pizza/Маргарита.jpg",
               IsAvailable = true,
               Ingredients = "Хрупкав блат, Доматена салса с босилек и риган, Кашкавал, Моцарела, Пресен домат",
               PreparationTime = 10,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 11,
               Name = "Формула",
               Description = "Представяме ви нашата емблематична пица Формола – истинска наслада за любителите на месо! На хрупкавия блат нанасяме ароматна доматена салса с босилек и риган, която съчетава всички съставки. Богатият слой кашкавал покрива щедро количество телешко мляно месо, сочен бекон, крехко пилешко филе и пикантно чоризо. Завършваме с топено сирене, което добавя кремообразна текстура. Тази пица е идеалният избор за всички месо любители, търсещи интензивен вкус и удоволствие във всяка хапка!",
               Price = 13.90M,
               Quantity = 480,
               CategoryId = 10,
               ImageURL = "assets/img/Menu/Pizza/Формула.jpg",
               IsAvailable = true,
               Ingredients = "Хрупкав блат, Доматена салса с босилек и риган, Кашкавал, Телешко Мляно, Бекон, Пилешко филе, Чоризо, Топено сирене",
               PreparationTime = 10,
               IsDeleted = false
            },

            new MenuItem()
            {
               MenuItemId = 12,
               Name = "Шопска-салата",
               Description = "Насладете се на нашата традиционна Шопска салата – класическо българско удоволствие! Съчетава свежи домати, краставици и пресен пипер за перфектна хрупкавост. Добавяме меко краве сирене, което придава кремообразност и богатство на вкуса. Лукът и магданозът добавят свежест и аромат, а маслината завършва всичко с лек солен акцент. Тази салата е идеална за всеки повод и носи усещане за домашен уют и традиция.",
               Price = 9.90M,
               Quantity = 300,
               CategoryId = 3,
               ImageURL = "assets/img/Menu/Salad/Шопска-салата.jpg",
               IsAvailable = true,
               Ingredients = "Домат, Краставица, Пресен пипер, Краве сирене, Лук, Магданоз, Маслина",
               PreparationTime = 8,
               IsDeleted = false
            },
        };
    }
}

